apache/nuttx/arch/arm/src/lpc31xx/lpc31_ehci.c
#ifdef HAVE_USBHOST_TRACE_VERBOSE
  EHCI_VTRACE1_PORTSC_CSC,          /* EHCI Connect Status Change */
  EHCI_VTRACE1_PORTSC_CONNALREADY,  /* EHCI Already connected */
  EHCI_VTRACE1_PORTSC_DISCALREADY,  /* EHCI Already disconnected */
  EHCI_VTRACE1_TOPHALF,             /* EHCI Interrupt top half */
  EHCI_VTRACE1_AAINTR,              /* EHCI Async Advance Interrupt */

  EHCI_VTRACE1_CLASSENUM,           /* EHCI Hub port CLASS enumeration */
  EHCI_VTRACE1_USBINTR,             /* EHCI USB Interrupt (USBINT) Interrupt */
  EHCI_VTRACE1_ENUM_DISCONN,        /* EHCI Enumeration not connected */
  EHCI_VTRACE1_INITIALIZING,        /* EHCI Initializing EHCI Stack */
  EHCI_VTRACE1_HCCPARAMS,           /* EHCI HCCPARAMS */
  EHCI_VTRACE1_INIITIALIZED,        /* EHCI USB EHCI Initialized */
#endif

  __TRACE1_NSTRINGS,                /* Separates the format 1 from the format 2 strings */

  EHCI_TRACE2_EPSTALLED,            /* EHCI EP Stalled */
  EHCI_TRACE2_EPIOERROR,            /* EHCI ERROR: EP TOKEN */
  EHCI_TRACE2_CLASSENUM_FAILED,     /* EHCI usbhost_enumerate() failed */

#ifdef HAVE_USBHOST_TRACE_VERBOSE
  EHCI_VTRACE2_ASYNCXFR,            /* EHCI Async transfer */
  EHCI_VTRACE2_INTRXFR,             /* EHCI Interrupt Transfer */
  EHCI_VTRACE2_IOCCHECK,            /* EHCI IOC */
  EHCI_VTRACE2_PORTSC,              /* EHCI PORTSC */
  EHCI_VTRACE2_PORTSC_CONNECTED,    /* EHCI RHPort connected */
  EHCI_VTRACE2_PORTSC_DISCONND,     /* EHCI RHport disconnected */
  EHCI_VTRACE2_MONWAKEUP,           /* EHCI RHPort connected wakeup */

  EHCI_VTRACE2_EPALLOC,             /* EHCI EPALLOC */
  EHCI_VTRACE2_CTRLINOUT,           /* EHCI CTRLIN/OUT */
  EHCI_VTRACE2_HCIVERSION,          /* EHCI HCIVERSION */
  EHCI_VTRACE2_HCSPARAMS,           /* EHCI HCSPARAMS */
#endif

  __TRACE2_NSTRINGS                 /* Total number of enumeration values */
};

/* USB trace data structure */

struct lpc31_ehci_trace_s
{
#if 0
  uint16_t id;
  bool fmt2;
#endif
  const char *string;
};

#endif /* HAVE_USBHOST_TRACE */

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

static uint16_t lpc31_read16(const uint8_t *addr);
static uint32_t lpc31_read32(const uint8_t *addr);
#if 0 /* Not used */
static void lpc31_write16(uint16_t memval, uint8_t *addr);
static void lpc31_write32(uint32_t memval, uint8_t *addr);
#endif

#ifdef CONFIG_ENDIAN_BIG
static uint16_t lpc31_swap16(uint16_t value);
static uint32_t lpc31_swap32(uint32_t value);
#else
#  define lpc31_swap16(value) (value)
#  define lpc31_swap32(value) (value)
#endif

#ifdef CONFIG_LPC31_EHCI_REGDEBUG
static void lpc31_printreg(volatile uint32_t *regaddr, uint32_t regval,
         bool iswrite);
static void lpc31_checkreg(volatile uint32_t *regaddr, uint32_t regval,
         bool iswrite);
static uint32_t lpc31_getreg(volatile uint32_t *regaddr);
static void lpc31_putreg(uint32_t regval, volatile uint32_t *regaddr);
#else
static inline uint32_t lpc31_getreg(volatile uint32_t *regaddr);
static inline void lpc31_putreg(uint32_t regval, volatile uint32_t *regaddr);
#endif
static int ehci_wait_usbsts(uint32_t maskbits, uint32_t donebits,
         unsigned int delay);

/* Allocators ***************************************************************/

static struct lpc31_qh_s *lpc31_qh_alloc(void);
static void lpc31_qh_free(struct lpc31_qh_s *qh);
static struct lpc31_qtd_s *lpc31_qtd_alloc(void);
static void lpc31_qtd_free(struct lpc31_qtd_s *qtd);

/* List Management **********************************************************/

static int lpc31_qh_foreach(struct lpc31_qh_s *qh, uint32_t **bp,
         foreach_qh_t handler, void *arg);
static int lpc31_qtd_foreach(struct lpc31_qh_s *qh, foreach_qtd_t handler,
         void *arg);
static int lpc31_qtd_discard(struct lpc31_qtd_s *qtd, uint32_t **bp,
         void *arg);
static int lpc31_qh_discard(struct lpc31_qh_s *qh);

/* Cache Operations *********************************************************/

#if 0 /* Not used */
static int lpc31_qtd_invalidate(struct lpc31_qtd_s *qtd, uint32_t **bp,
         void *arg);
static int lpc31_qh_invalidate(struct lpc31_qh_s *qh);
#endif
static int lpc31_qtd_flush(struct lpc31_qtd_s *qtd, uint32_t **bp,
         void *arg);
static int lpc31_qh_flush(struct lpc31_qh_s *qh);

/* Endpoint Transfer Handling ***********************************************/

#ifdef CONFIG_LPC31_EHCI_REGDEBUG
static void lpc31_qtd_print(struct lpc31_qtd_s *qtd);
static void lpc31_qh_print(struct lpc31_qh_s *qh);
static int  lpc31_qtd_dump(struct lpc31_qtd_s *qtd, uint32_t **bp,
         void *arg);
static int  lpc31_qh_dump(struct lpc31_qh_s *qh, uint32_t **bp, void *arg);
#else
#  define lpc31_qtd_print(qtd)
#  define lpc31_qh_print(qh)
#  define lpc31_qtd_dump(qtd, bp, arg) OK
#  define lpc31_qh_dump(qh, bp, arg)   OK
#endif

static inline uint8_t lpc31_ehci_speed(uint8_t usbspeed);
static int lpc31_ioc_setup(struct lpc31_rhport_s *rhport,
         struct lpc31_epinfo_s *epinfo);
static int lpc31_ioc_wait(struct lpc31_epinfo_s *epinfo);
static void lpc31_qh_enqueue(struct lpc31_qh_s *qhead,
         struct lpc31_qh_s *qh);
static struct lpc31_qh_s *lpc31_qh_create(struct lpc31_rhport_s *rhport,
         struct lpc31_epinfo_s *epinfo);
static int lpc31_qtd_addbpl(struct lpc31_qtd_s *qtd, const void *buffer,
         size_t buflen);
static struct lpc31_qtd_s *lpc31_qtd_setupphase(
         struct lpc31_epinfo_s *epinfo, const struct usb_ctrlreq_s *req);
static struct lpc31_qtd_s *lpc31_qtd_dataphase(struct lpc31_epinfo_s *epinfo,
         void *buffer, int buflen, uint32_t tokenbits);
static struct lpc31_qtd_s *lpc31_qtd_statusphase(uint32_t tokenbits);
static ssize_t lpc31_async_setup(struct lpc31_rhport_s *rhport,
         struct lpc31_epinfo_s *epinfo, const struct usb_ctrlreq_s *req,
         uint8_t *buffer, size_t buflen);
#ifndef CONFIG_USBHOST_INT_DISABLE
static int lpc31_intr_setup(struct lpc31_rhport_s *rhport,
         struct lpc31_epinfo_s *epinfo, uint8_t *buffer, size_t buflen);
#endif
static ssize_t lpc31_transfer_wait(struct lpc31_epinfo_s *epinfo);
#ifdef CONFIG_USBHOST_ASYNCH
static inline int lpc31_ioc_async_setup(struct lpc31_rhport_s *rhport,
         struct lpc31_epinfo_s *epinfo, usbhost_asynch_t callback,
         void *arg);
static void lpc31_asynch_completion(struct lpc31_epinfo_s *epinfo);
#endif

/* Interrupt Handling *******************************************************/

static int lpc31_qtd_ioccheck(struct lpc31_qtd_s *qtd, uint32_t **bp,
         void *arg);
static int lpc31_qh_ioccheck(struct lpc31_qh_s *qh, uint32_t **bp,
         void *arg);
#ifdef CONFIG_USBHOST_ASYNCH
static int lpc31_qtd_cancel(struct lpc31_qtd_s *qtd, uint32_t **bp,
         void *arg);
static int lpc31_qh_cancel(struct lpc31_qh_s *qh, uint32_t **bp, void *arg);
#endif
static inline void lpc31_ioc_bottomhalf(void);
static inline void lpc31_portsc_bottomhalf(void);
static inline void lpc31_syserr_bottomhalf(void);
static inline void lpc31_async_advance_bottomhalf(void);
static void lpc31_ehci_bottomhalf(void *arg);
static int lpc31_ehci_interrupt(int irq, void *context, void *arg);

/* USB Host Controller Operations *******************************************/

static int lpc31_wait(struct usbhost_connection_s *conn,
         struct usbhost_hubport_s **hport);
static int lpc31_rh_enumerate(struct usbhost_connection_s *conn,
         struct usbhost_hubport_s *hport);
static int lpc31_enumerate(struct usbhost_connection_s *conn,
         struct usbhost_hubport_s *hport);

static int lpc31_ep0configure(struct usbhost_driver_s *drvr,
         usbhost_ep_t ep0, uint8_t funcaddr, uint8_t speed,
         uint16_t maxpacketsize);
static int lpc31_epalloc(struct usbhost_driver_s *drvr,
                         const struct usbhost_epdesc_s *epdesc,
                         usbhost_ep_t *ep);
static int lpc31_epfree(struct usbhost_driver_s *drvr, usbhost_ep_t ep);
static int lpc31_alloc(struct usbhost_driver_s *drvr,
         uint8_t **buffer, size_t *maxlen);
static int lpc31_free(struct usbhost_driver_s *drvr,
         uint8_t *buffer);
static int lpc31_ioalloc(struct usbhost_driver_s *drvr,
         uint8_t **buffer, size_t buflen);
static int lpc31_iofree(struct usbhost_driver_s *drvr,
         uint8_t *buffer);
static int lpc31_ctrlin(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
         const struct usb_ctrlreq_s *req, uint8_t *buffer);
static int lpc31_ctrlout(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
         const struct usb_ctrlreq_s *req, const uint8_t *buffer);
static ssize_t lpc31_transfer(struct usbhost_driver_s *drvr,
         usbhost_ep_t ep, uint8_t *buffer, size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static int lpc31_asynch(struct usbhost_driver_s *drvr, usbhost_ep_t ep,
         uint8_t *buffer, size_t buflen, usbhost_asynch_t callback,
         void *arg);
#endif
static int lpc31_cancel(struct usbhost_driver_s *drvr, usbhost_ep_t ep);
#ifdef CONFIG_USBHOST_HUB
static int lpc31_connect(struct usbhost_driver_s *drvr,
         struct usbhost_hubport_s *hport, bool connected);
#endif
static void lpc31_disconnect(struct usbhost_driver_s *drvr,
                             struct usbhost_hubport_s *hport);

/* Initialization ***********************************************************/

static int lpc31_reset(void);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* In this driver implementation, support is provided for only a single
 * USB device.  All status information can be simply retained in a single
 * global instance.
 */

static struct lpc31_ehci_s g_ehci =
{
  .lock = NXMUTEX_INITIALIZER,
  .pscsem = SEM_INITIALIZER(0),
  .ep0.iocsem = SEM_INITIALIZER(1),
};

/* This is the connection/enumeration interface */

static struct usbhost_connection_s g_ehciconn =
{
  .wait = lpc31_wait,
  .enumerate = lpc31_enumerate,
};

