apache/nuttx/arch/arm/src/lpc31xx/lpc31_ehci.c
      regval = lpc31_getreg(&HCOR->usbsts);
    }
  while (((regval & EHCI_USBSTS_HALTED) == 0) && (timeout < 1000));

  /* Is the EHCI still running?  Did we timeout? */

  if ((regval & EHCI_USBSTS_HALTED) == 0)
    {
      usbhost_trace1(EHCI_TRACE1_HCHALTED_TIMEOUT, regval);
      return -ETIMEDOUT;
    }

  /* Now we can set the HCReset bit in the USBCMD register to initiate the
   * reset
   */

  regval  = lpc31_getreg(&HCOR->usbcmd);
  regval |= EHCI_USBCMD_HCRESET;
  lpc31_putreg(regval, &HCOR->usbcmd);

  /* Wait for the HCReset bit to become clear */

  do
    {
      /* Wait five microsecondw and update the timeout counter */

      up_udelay(5);
      timeout += 5;

      /* Get the current value of the USBCMD register.  This loop will
       * terminate when either the timeout exceeds one second or when the
       * HCReset bit is no longer set in the USBSTS register.
       */

      regval = lpc31_getreg(&HCOR->usbcmd);
    }
  while (((regval & EHCI_USBCMD_HCRESET) != 0) && (timeout < 1000000));

  /* Return either success or a timeout */

  return (regval & EHCI_USBCMD_HCRESET) != 0 ? -ETIMEDOUT : OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc31_ehci_initialize
 *
 * Description:
 *   Initialize USB EHCI host controller hardware.
 *
 * Input Parameters:
 *   controller -- If the device supports more than one EHCI interface, then
 *     this identifies which controller is being initialized.  Normally, this
 *     is just zero.
 *
 * Returned Value:
 *   And instance of the USB host interface.  The controlling task should
 *   use this interface to (1) call the wait() method to wait for a device
 *   to be connected, and (2) call the enumerate() method to bind the device
 *   to a class driver.
 *
 * Assumptions:
 * - This function should called in the initialization sequence in order
 *   to initialize the USB device functionality.
 * - Class drivers should be initialized prior to calling this function.
 *   Otherwise, there is a race condition if the device is already connected.
 *
 ****************************************************************************/

struct usbhost_connection_s *lpc31_ehci_initialize(int controller)
{
  struct usbhost_hubport_s *hport;
  uint32_t regval;
#if defined(CONFIG_DEBUG_USB) && defined(CONFIG_DEBUG_ASSERTIONS)
  uint16_t regval16;
  unsigned int nports;
#endif
  uintptr_t physaddr;
  int ret;
  int i;

  /* Sanity checks */

  DEBUGASSERT(controller == 0);
  DEBUGASSERT(((uintptr_t)&g_asynchead & 0x1f) == 0);
  DEBUGASSERT((sizeof(struct lpc31_qh_s) & 0x1f) == 0);
  DEBUGASSERT((sizeof(struct lpc31_qtd_s) & 0x1f) == 0);

#ifdef CONFIG_LPC31_EHCI_PREALLOCATE
  DEBUGASSERT(((uintptr_t)&g_qhpool & 0x1f) == 0);
  DEBUGASSERT(((uintptr_t)&g_qtdpool & 0x1f) == 0);
#endif

#ifndef CONFIG_USBHOST_INT_DISABLE
  DEBUGASSERT(((uintptr_t)&g_intrhead & 0x1f) == 0);
#ifdef CONFIG_LPC31_EHCI_PREALLOCATE
  DEBUGASSERT(((uintptr_t)g_framelist & 0xfff) == 0);
#endif
#endif /* CONFIG_USBHOST_INT_DISABLE */

  /* Software Configuration *************************************************/

  usbhost_vtrace1(EHCI_VTRACE1_INITIALIZING, 0);

  /* Initialize function address generation logic */

  usbhost_devaddr_initialize(&g_ehci.devgen);

  /* Initialize the root hub port structures */

  for (i = 0; i < LPC31_EHCI_NRHPORT; i++)
    {
      struct lpc31_rhport_s *rhport = &g_ehci.rhport[i];

      /* Initialize the device operations */

      rhport->drvr.ep0configure   = lpc31_ep0configure;
      rhport->drvr.epalloc        = lpc31_epalloc;
      rhport->drvr.epfree         = lpc31_epfree;
      rhport->drvr.alloc          = lpc31_alloc;
      rhport->drvr.free           = lpc31_free;
      rhport->drvr.ioalloc        = lpc31_ioalloc;
      rhport->drvr.iofree         = lpc31_iofree;
      rhport->drvr.ctrlin         = lpc31_ctrlin;
      rhport->drvr.ctrlout        = lpc31_ctrlout;
      rhport->drvr.transfer       = lpc31_transfer;
#ifdef CONFIG_USBHOST_ASYNCH
      rhport->drvr.asynch         = lpc31_asynch;
#endif
      rhport->drvr.cancel         = lpc31_cancel;
#ifdef CONFIG_USBHOST_HUB
      rhport->drvr.connect        = lpc31_connect;
#endif
      rhport->drvr.disconnect     = lpc31_disconnect;
      rhport->hport.pdevgen       = &g_ehci.devgen;

      /* Initialize EP0 */

      rhport->ep0.xfrtype         = USB_EP_ATTR_XFER_CONTROL;
      rhport->ep0.speed           = USB_SPEED_FULL;
      rhport->ep0.maxpacket       = 8;

      nxsem_init(&rhport->ep0.iocsem, 0, 0);

      /* Initialize the public port representation */

      hport                       = &rhport->hport.hport;
      hport->drvr                 = &rhport->drvr;
#ifdef CONFIG_USBHOST_HUB
      hport->parent               = NULL;
#endif
      hport->ep0                  = &rhport->ep0;
      hport->port                 = i;
      hport->speed                = USB_SPEED_FULL;
    }

#ifndef CONFIG_LPC31_EHCI_PREALLOCATE
  /* Allocate a pool of free Queue Head (QH) structures */

  g_qhpool = (struct lpc31_qh_s *)
    kmm_memalign(32, CONFIG_LPC31_EHCI_NQHS * sizeof(struct lpc31_qh_s));
  if (!g_qhpool)
    {
      usbhost_trace1(EHCI_TRACE1_QHPOOLALLOC_FAILED, 0);
      return NULL;
    }
#endif

  /* Initialize the list of free Queue Head (QH) structures */

  for (i = 0; i < CONFIG_LPC31_EHCI_NQHS; i++)
    {
      /* Put the QH structure in a free list */

      lpc31_qh_free(&g_qhpool[i]);
    }

#ifndef CONFIG_LPC31_EHCI_PREALLOCATE
  /* Allocate a pool of free  Transfer Descriptor (qTD) structures */

  g_qtdpool = (struct lpc31_qtd_s *)
    kmm_memalign(32, CONFIG_LPC31_EHCI_NQTDS * sizeof(struct lpc31_qtd_s));
  if (!g_qtdpool)
    {
      usbhost_trace1(EHCI_TRACE1_QTDPOOLALLOC_FAILED, 0);
      kmm_free(g_qhpool);
      return NULL;
    }
#endif

#if !defined(CONFIG_LPC31_EHCI_PREALLOCATE) && !defined(CONFIG_USBHOST_INT_DISABLE)
  /* Allocate the periodic framelist  */

  g_framelist = (uint32_t *)
    kmm_memalign(4096, FRAME_LIST_SIZE * sizeof(uint32_t));
  if (!g_framelist)
    {
      usbhost_trace1(EHCI_TRACE1_PERFLALLOC_FAILED, 0);
      kmm_free(g_qhpool);
      kmm_free(g_qtdpool);
      return NULL;
    }
#endif

  /* Initialize the list of free Transfer Descriptor (qTD) structures */

  for (i = 0; i < CONFIG_LPC31_EHCI_NQTDS; i++)
    {
      /* Put the TD in a free list */

      lpc31_qtd_free(&g_qtdpool[i]);
    }

  /* EHCI Hardware Configuration ********************************************/

  /* Enable USB to AHB clock and to Event router */

  lpc31_enableclock(CLKID_USBOTGAHBCLK);
  lpc31_enableclock(CLKID_EVENTROUTERPCLK);

