apache/nuttx/arch/arm/src/lpc31xx/lpc31_ehci.c
  /* Reset USB block */

  lpc31_softreset(RESETID_USBOTGAHBRST);

  /* Enable USB OTG PLL and wait for lock */

  putreg32(0, LPC31_SYSCREG_USB_ATXPLLPDREG);

  uint32_t bank = EVNTRTR_BANK(EVENTRTR_USBATXPLLLOCK);
  uint32_t bit  = EVNTRTR_BIT(EVENTRTR_USBATXPLLLOCK);

  while ((getreg32(LPC31_EVNTRTR_RSR(bank)) & (1 << bit)) == 0)
    ;

  /* Enable USB AHB clock */

  lpc31_enableclock (CLKID_USBOTGAHBCLK);

  /* Reset the controller from the OTG peripheral */

  putreg32(USBDEV_USBCMD_RST, LPC31_USBDEV_USBCMD);
  while ((getreg32(LPC31_USBDEV_USBCMD) & USBDEV_USBCMD_RST) != 0)
      ;

  /* Program the controller to be the USB host controller
   *
   * Fixed selections:
   *
   *   CM   = Host mode
   *   ES   = 0, Little endian mode.
   *   SLOM   Not used in host mode.
   *   VBPS = 1, off-chip power source
   *
   * Configurable selections:
   *
   *   SDIS = 1, Stream disable mode.  Eliminates overruns/underruns at
   *          the expense of some performance.
   */

#ifdef CONFIG_LPC31_EHCI_SDIS
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_SDIS |
           USBHOST_USBMODE_VBPS,
           LPC31_USBDEV_USBMODE);
#else
  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_VBPS,
           LPC31_USBDEV_USBMODE);
#endif

  /* Host Controller Initialization. Paragraph 4.1 */

  /* Reset the EHCI hardware */

  ret = lpc31_reset();
  if (ret < 0)
    {
      usbhost_trace1(EHCI_TRACE1_RESET_FAILED, -ret);
      return NULL;
    }

  /* Re-program the USB host controller.  As implemented, lpc31_reset()
   * requires the host mode setup in order to work.  However, we lose the
   * host configuration in the reset.
   */

  putreg32(USBHOST_USBMODE_CM_HOST | USBHOST_USBMODE_SDIS |
           USBHOST_USBMODE_VBPS,
           LPC31_USBDEV_USBMODE);

  /* "In order to initialize the host controller, software should perform
   *  the following steps:
   *
   *  - "Program the CTRLDSSEGMENT register with 4-Gigabyte segment where
   *     all of the interface data structures are allocated. [64-bit mode]
   *  - "Write the appropriate value to the USBINTR register to enable the
   *     appropriate interrupts.
   *  - "Write the base address of the Periodic Frame List to the
   *     PERIODICLIST BASE register. If there are no work items in the
   *     periodic schedule, all elements of the Periodic Frame List should
   *     have their T-Bits set to a one.
   *  - "Write the USBCMD register to set the desired interrupt threshold,
   *     frame list size (if applicable) and turn the host controller ON via
   *     setting the Run/Stop bit.
   *  -  Write a 1 to CONFIGFLAG register to route all ports to the EHCI
   *     controller
   *     ...
   *
   * "At this point, the host controller is up and running and the port
   *  registers will begin reporting device connects, etc. System software
   *  can enumerate a port through the reset process (where the port is in
   *  the enabled state).  At this point, the port is active with SOFs
   *  occurring down the enabled port enabled Highspeed ports, but the
   *  schedules have not yet been enabled. The EHCI Host controller will not
   *  transmit SOFs to enabled Full- or Low-speed ports."
   */

  /* Disable all interrupts */

  lpc31_putreg(0, &HCOR->usbintr);

  /* Clear pending interrupts.  Bits in the USBSTS register are cleared by
   * writing a '1' to the corresponding bit.
   */

  lpc31_putreg(EHCI_INT_ALLINTS, &HCOR->usbsts);

#if defined(CONFIG_DEBUG_USB) && defined(CONFIG_DEBUG_ASSERTIONS)
  /* Show the EHCI version */

  regval16 = lpc31_swap16(HCCR->hciversion);
  usbhost_vtrace2(EHCI_VTRACE2_HCIVERSION, regval16 >> 8, regval16 & 0xff);

  /* Verify that the correct number of ports is reported */

  regval = lpc31_getreg(&HCCR->hcsparams);
  nports = (regval & EHCI_HCSPARAMS_NPORTS_MASK) >>
           EHCI_HCSPARAMS_NPORTS_SHIFT;

  usbhost_vtrace2(EHCI_VTRACE2_HCSPARAMS, nports, regval);
  DEBUGASSERT(nports == LPC31_EHCI_NRHPORT);

  /* Show the HCCPARAMS register */

  regval = lpc31_getreg(&HCCR->hccparams);
  usbhost_vtrace1(EHCI_VTRACE1_HCCPARAMS, regval);
#endif

  /* Initialize the head of the asynchronous queue/reclamation list.
   *
   * "In order to communicate with devices via the asynchronous schedule,
   *  system software must write the ASYNDLISTADDR register with the address
   *  of a control or bulk queue head. Software must then enable the
   *  asynchronous schedule by writing a one to the Asynchronous Schedule
   *  Enable bit in the USBCMD register. In order to communicate with devices
   *  via the periodic schedule, system software must enable the periodic
   *  schedule by writing a one to the Periodic Schedule Enable bit in the
   *  USBCMD register. Note that the schedules can be turned on before the
   *  first port is reset (and enabled)."
   */

  memset(&g_asynchead, 0, sizeof(struct lpc31_qh_s));
  physaddr                     = lpc31_physramaddr((uintptr_t)&g_asynchead);
  g_asynchead.hw.hlp           = lpc31_swap32(physaddr | QH_HLP_TYP_QH);
  g_asynchead.hw.epchar        = lpc31_swap32(QH_EPCHAR_H |
                                              QH_EPCHAR_EPS_FULL);
  g_asynchead.hw.overlay.nqp   = lpc31_swap32(QH_NQP_T);
  g_asynchead.hw.overlay.alt   = lpc31_swap32(QH_NQP_T);
  g_asynchead.hw.overlay.token = lpc31_swap32(QH_TOKEN_HALTED);
  g_asynchead.fqp              = lpc31_swap32(QTD_NQP_T);

  up_clean_dcache((uintptr_t)&g_asynchead.hw,
                  (uintptr_t)&g_asynchead.hw + sizeof(struct ehci_qh_s));

  /* Set the Current Asynchronous List Address. */

  lpc31_putreg(lpc31_swap32(physaddr), &HCOR->asynclistaddr);

#ifndef CONFIG_USBHOST_INT_DISABLE
  /* Initialize the head of the periodic list.  Since Isochronous
   * endpoints are not not yet supported, each element of the
   * frame list is initialized to point to the Interrupt Queue
   * Head (g_intrhead).
   */

  memset(&g_intrhead, 0, sizeof(struct lpc31_qh_s));
  g_intrhead.hw.hlp           = lpc31_swap32(QH_HLP_T);
  g_intrhead.hw.overlay.nqp   = lpc31_swap32(QH_NQP_T);
  g_intrhead.hw.overlay.alt   = lpc31_swap32(QH_NQP_T);
  g_intrhead.hw.overlay.token = lpc31_swap32(QH_TOKEN_HALTED);
  g_intrhead.hw.epcaps        = lpc31_swap32(QH_EPCAPS_SSMASK(1));

  /* Attach the periodic QH to Period Frame List */

